CLASS_NAMES = [
    "快餐盒", "污损塑料", "烟头", "牙签", "花盆", "竹筷", "剩饭剩菜", "骨头", "水果皮", "纸浆",
    "茶叶", "蔬菜", "蛋壳", "鱼骨", "充电宝", "包", "化妆品瓶", "玩具", "塑料碗", "塑料衣架",
    "纸袋", "插头电线", "旧衣物", "易拉罐", "枕头", "毛绒玩具", "洗发水瓶", "玻璃杯", "鞋子", "铁砧",
    "纸板箱", "调味品瓶", "酒瓶", "金属食品罐", "锅", "食用油桶", "饮料瓶", "干电池", "药膏", "过期药品"
]

GARBAGE_TYPE_MAP = {
    "快餐盒": "其他垃圾", "污损塑料": "其他垃圾", "烟头": "其他垃圾", "牙签": "其他垃圾",
    "花盆": "其他垃圾", "竹筷": "其他垃圾", "剩饭剩菜": "厨余垃圾", "骨头": "厨余垃圾",
    "水果皮": "厨余垃圾", "纸浆": "厨余垃圾", "茶叶": "厨余垃圾", "蔬菜": "厨余垃圾",
    "蛋壳": "厨余垃圾", "鱼骨": "厨余垃圾", "充电宝": "可回收物", "包": "可回收物",
    "化妆品瓶": "有害垃圾", "玩具": "可回收物", "塑料碗": "可回收物", "塑料衣架": "可回收物",
    "纸袋": "可回收物", "插头电线": "可回收物", "旧衣物": "可回收物", "易拉罐": "可回收物",
    "枕头": "可回收物", "毛绒玩具": "可回收物", "洗发水瓶": "可回收物", "玻璃杯": "可回收物",
    "鞋子": "可回收物", "铁砧": "可回收物", "纸板箱": "可回收物", "调味品瓶": "可回收物",
    "酒瓶": "可回收物", "金属食品罐": "可回收物", "锅": "可回收物", "食用油桶": "可回收物",
    "饮料瓶": "可回收物", "干电池": "有害垃圾", "药膏": "有害垃圾", "过期药品": "有害垃圾"
}